2/p/TEST/src/DataProcessors/ВыполнитьЗаполнениеПеремешиванияОтветов/ВыполнитьЗаполнениеПеремешиванияОтветов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыполнитьЗаполнениеПеремешиванияОтветов</name>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.ТС_Курсы</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

2/p/TEST/src/Catalogs/ТС_Тесты/ТС_Тесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТС_Тесты</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТС_Курсы</owners>
  <attributes>
    <name>Вопрос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Устаревший</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>CatalogRef.ТС_Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьОтветы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательФайла</name>
    <type>
      <types>CatalogRef.ТС_Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВопроса</name>
    <comment>Для загрузки данных</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРаздела</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DL_RES_Free</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DL_RES_Dist</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответы</name>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>удПодтверждение</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаПодтверждение</name>
      <type>
        <types>DocumentRef.ТС_РезультатТестирования</types>
        <types>CatalogRef.ТС_Файлы</types>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КартинкиВКомментариях</name>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>CatalogRef.ТС_Файлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

2/p/TEST/src/DataProcessors/ВыполнитьЗаполнениеПеремешиванияОтветов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
	Сообщить("Обработка завершена");
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	
	ТаблицаТестов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТС_ТестыОтветы.Ссылка КАК ТестСсылка,
		|	ТС_ТестыОтветы.Ответ КАК Ответ
		|ИЗ
		|	Справочник.ТС_Тесты.Ответы КАК ТС_ТестыОтветы
		|ГДЕ
		|	НЕ ТС_ТестыОтветы.Ссылка.ПометкаУдаления
		|	И НЕ ТС_ТестыОтветы.Ссылка.Устаревший
		|	И ВЫБОР
		|			КОГДА &УказанКурс
		|				ТОГДА ТС_ТестыОтветы.Ссылка.Владелец = &Владелец
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТС_ТестыОтветы.Ссылка.Код
		|ИТОГИ ПО
		|	ТестСсылка";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Курс);
	Запрос.УстановитьПараметр("УказанКурс", ЗначениеЗаполнено(Объект.Курс));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		ПеремешиватьОтветы = Истина;
		
		ВыборкаОтвет = Выборка.Выбрать();
		
		Пока ВыборкаОтвет.Следующий() Цикл
			
			ПеремешиватьОтветы = ЭтотВопросПеремешиваем(ВыборкаОтвет.Ответ);
			
			Если Не ПеремешиватьОтветы Тогда 
				Прервать;
			КонецЕсли;
			
		КонецЦикла;

		ТестСтрока = ТаблицаТестов.Добавить();
		ЗаполнитьЗначенияСвойств(ТестСтрока,Выборка);
		ТестСтрока.ПеремешиватьОтветы = ПеремешиватьОтветы;
		
	КонецЦикла;
	
	Для Каждого ТестСтрока Из ТаблицаТестов Цикл
		
		ТестОбъект = ТестСтрока.ТестСсылка.ПолучитьОбъект();
		ТестОбъект.ПеремешиватьОтветы = ТестСтрока.ПеремешиватьОтветы;
		
		Попытка
			ТестОбъект.Записать();
		Исключение
			Сообщить("Не удалось изменить статус """ + 
			Формат( ТестСтрока.ПеремешиватьОтветы,"БЛ='Не перемешивать'; БИ=Перемешивать") + 
			""" для теста " + ТестОбъект.ТестСсылка);
		КонецПопытки;
			
	КонецЦикла;
	
	
КонецПроцедуры

Функция ЭтотВопросПеремешиваем(Знач ОтветНаВопрос)
	
	ОтветВерхРег = ВРег(ОтветНаВопрос);
	
	Для Каждого ВариантОтвета Из СписокВариантов Цикл
		
		Если НЕ СтрНайти(ОтветВерхРег, ВРег(ВариантОтвета)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции
